Revit 2024 API
AreaReinforcement.SetUnobscuredInView Method
 Sets Area Reinforcement to be shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetUnobscuredInView(
	View view,
	bool unobscured
)
Visual Basic
Public Sub SetUnobscuredInView ( _
	view As View, _
	unobscured As Boolean _
)
Visual C++
public:
void SetUnobscuredInView(
	View^ view,
	bool unobscured
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view element
unobscured
Type: System.Boolean
 True if Area Reinforcement is shown unobscured, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace